# UseRangeForAllMeasurements Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
SpatialFieldManager..::..UseRangeForAllMeasurements Property
SpatialFieldManager Class See Also
---
Governs how minimum and maximum values (the data range) are calculated.
**Namespace:** Autodesk.Revit.DB.Analysis**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2011
# Syntax
C#
---
```text
public bool UseRangeForAllMeasurements { get; set; }
```

Visual Basic
---
```text
Public Property UseRangeForAllMeasurements As Boolean
	Get
	Set
```

Visual C++
---
```text
public:
property bool UseRangeForAllMeasurements {
	bool get ();
	void set (bool value);
}
```

# Remarks
If true the data range is calculated from all measurements. Otherwise the data range is calculated from the current measurement only.
# See Also
SpatialFieldManager Class
Autodesk.Revit.DB.Analysis Namespace